app/Controllers/UserController.php

                'password' => $password,
                'contact' => $contact,
            ];
            $usermodel->save($data);
---
INSERT INTO `user` (`name`, `email`, `password`, `contact`) VALUES ('Anil Mandal', 'suraj@gmail.com', 'Anil@123', '7657765787')

    public function getListOfUser(){
        if ($this->request->getMethod() == "get") {
            # code...
            return view('userData');
        }
        else if($this->request->getMethod() == "post"){
        $models = new userModel();
        $data['users'] = $models->findAll();
---
SELECT *
FROM `user`

    public function userDelete(){
        $models = new userModel();
        $data = stripslashes(file_get_contents("php://input"));
        $mydata = json_decode($data, true);
        $id = $mydata['sid'];
        $models->delete($id);
---
DELETE FROM `user`
WHERE `id` IN ('24')

    public function userUpdate(){
        $models = new userModel();
        $data = stripslashes(file_get_contents("php://input"));
        $mydata = json_decode($data, true);
        $name = $mydata['name'];
        $email = $mydata['email'];
        $password = $mydata['password'];
        $contact = $mydata['contact'];

        // $name = $this->request->getPost('name');
        // echo $name;
        // print_r($name);
        $data = [
            'name' => $name,
            'email' => $email,
            'password' => $password,
            'contact' => $contact,
        ];
        $id = $mydata['id'];
        $data =  $models->update($id, $data);
---
UPDATE `user` SET `name` = 'rahul Mandal', `email` = 'sohanerfghjk@gmail.com', `password` = 'Rahul@123', `contact` = '9855676789'
WHERE `user`.`id` IN ('9')